[36mHello, I'm Chungus.
[0m[36mWhat can I do for you?

[0mchungus> [36mOkay, I've added this task:
[0m[36m  [T][ ] go to the moon
[0m[36mNow you have 1 task.
[0m[0m
chungus> [36mOkay, I've added this task:
[0m[36m  [D][ ] pirate games (by: this Friday)
[0m[36mNow you have 2 tasks.
[0m[0m
chungus> [36mOkay, I've added this task:
[0m[36m  [E][ ] Trump's wedding (from: 1 Oct. 1989 to: 2 Oct. 1989)
[0m[36mNow you have 3 tasks.
[0m[0m
chungus> [36mOkay, I've marked this task as completed:
[0m[36m  [T][X] go to the moon
[0m[0m
chungus> [36mOkay, I've marked this task as incomplete:
[0m[36m  [T][ ] go to the moon
[0m[0m
chungus> [36mOkay, I've marked this task as completed:
[0m[36m  [D][X] pirate games (by: this Friday)
[0m[0m
chungus> [36mOkay, I've marked this task as incomplete:
[0m[36m  [D][ ] pirate games (by: this Friday)
[0m[0m
chungus> [36mOkay, I've marked this task as completed:
[0m[36m  [E][X] Trump's wedding (from: 1 Oct. 1989 to: 2 Oct. 1989)
[0m[0m
chungus> [36mOkay, I've marked this task as incomplete:
[0m[36m  [E][ ] Trump's wedding (from: 1 Oct. 1989 to: 2 Oct. 1989)
[0m[0m
chungus> [31mBig big chungus.
[0m[0m
chungus> [31mInput format seems off.
[0m[0m
chungus> [31mInput format seems off.
[0m[0m
chungus> [36mBye!
[0m[0m